results/test1/zvol/a/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [F(4)][100.0%][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1096: Sat Mar 16 17:27:42 2024
  write: IOPS=304, BW=1220KiB/s (1249kB/s)(77.2MiB/64762msec); 0 zone resets
    slat (nsec): min=541, max=34655k, avg=49871.76, stdev=394634.51
    clat (nsec): min=581, max=6343.6M, avg=25155181.27, stdev=287879096.25
     lat (usec): min=20, max=6343.6k, avg=25205.05, stdev=287878.05
    clat percentiles (nsec):
     |  1.00th=[      1080],  5.00th=[     12736], 10.00th=[     57088],
     | 20.00th=[    104960], 30.00th=[    183296], 40.00th=[    259072],
     | 50.00th=[    366592], 60.00th=[    518144], 70.00th=[    774144],
     | 80.00th=[   1220608], 90.00th=[   2039808], 95.00th=[   3457024],
     | 99.00th=[ 851443712], 99.50th=[1652555776], 99.90th=[5133828096],
     | 99.95th=[5804916736], 99.99th=[6341787648]
   bw (  KiB/s): min=  280, max=14634, per=100.00%, avg=5262.00, stdev=3963.18, samples=30
   iops        : min=   70, max= 3658, avg=1315.43, stdev=990.79, samples=30
  lat (nsec)   : 750=0.29%, 1000=0.54%
  lat (usec)   : 2=1.27%, 4=1.45%, 10=1.23%, 20=0.74%, 50=2.26%
  lat (usec)   : 100=11.61%, 250=19.52%, 500=19.99%, 750=10.29%, 1000=6.65%
  lat (msec)   : 2=13.80%, 4=5.98%, 10=2.12%, 20=0.80%, 50=0.39%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.04%, 1000=0.12%, 2000=0.49%
  lat (msec)   : >=2000=0.41%
  cpu          : usr=0.35%, sys=5.15%, ctx=38912, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.5%, 4=49.4%, 8=45.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.7%, 8=3.3%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19752,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1097: Sat Mar 16 17:27:42 2024
  write: IOPS=297, BW=1190KiB/s (1218kB/s)(75.0MiB/64534msec); 0 zone resets
    slat (nsec): min=421, max=21145k, avg=39756.36, stdev=383722.88
    clat (nsec): min=561, max=6400.7M, avg=25907298.92, stdev=292482930.28
     lat (usec): min=20, max=6400.7k, avg=25947.06, stdev=292481.48
    clat percentiles (nsec):
     |  1.00th=[      1176],  5.00th=[     28032], 10.00th=[     60160],
     | 20.00th=[    109056], 30.00th=[    187392], 40.00th=[    254976],
     | 50.00th=[    362496], 60.00th=[    509952], 70.00th=[    765952],
     | 80.00th=[   1204224], 90.00th=[   2056192], 95.00th=[   3489792],
     | 99.00th=[ 910163968], 99.50th=[1753219072], 99.90th=[5133828096],
     | 99.95th=[5804916736], 99.99th=[6408896512]
   bw (  KiB/s): min=   72, max=11624, per=100.00%, avg=4948.26, stdev=3817.33, samples=31
   iops        : min=   18, max= 2906, avg=1237.00, stdev=954.35, samples=31
  lat (nsec)   : 750=0.41%, 1000=0.40%
  lat (usec)   : 2=0.83%, 4=1.05%, 10=1.07%, 20=0.67%, 50=2.32%
  lat (usec)   : 100=12.10%, 250=20.56%, 500=20.14%, 750=10.01%, 1000=6.62%
  lat (msec)   : 2=13.41%, 4=6.03%, 10=2.27%, 20=0.58%, 50=0.44%
  lat (msec)   : 100=0.02%, 500=0.04%, 1000=0.12%, 2000=0.50%, >=2000=0.42%
  cpu          : usr=0.34%, sys=4.81%, ctx=36458, majf=0, minf=0
  IO depths    : 1=0.6%, 2=3.9%, 4=50.1%, 8=45.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.9%, 8=3.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19195,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1098: Sat Mar 16 17:27:42 2024
  write: IOPS=311, BW=1245KiB/s (1275kB/s)(78.7MiB/64762msec); 0 zone resets
    slat (nsec): min=561, max=64940k, avg=56335.34, stdev=568443.95
    clat (nsec): min=521, max=6344.2M, avg=24635993.72, stdev=284254469.40
     lat (usec): min=19, max=6344.2k, avg=24692.33, stdev=284253.08
    clat percentiles (nsec):
     |  1.00th=[       860],  5.00th=[      3376], 10.00th=[     47872],
     | 20.00th=[    104960], 30.00th=[    189440], 40.00th=[    268288],
     | 50.00th=[    387072], 60.00th=[    552960], 70.00th=[    823296],
     | 80.00th=[   1236992], 90.00th=[   2039808], 95.00th=[   3260416],
     | 99.00th=[ 404750336], 99.50th=[1635778560], 99.90th=[4932501504],
     | 99.95th=[5804916736], 99.99th=[6341787648]
   bw (  KiB/s): min=   80, max=13920, per=100.00%, avg=5196.29, stdev=3908.69, samples=31
   iops        : min=   20, max= 3480, avg=1298.97, stdev=977.22, samples=31
  lat (nsec)   : 750=0.65%, 1000=0.65%
  lat (usec)   : 2=2.42%, 4=1.55%, 10=1.63%, 20=1.23%, 50=2.21%
  lat (usec)   : 100=8.99%, 250=18.50%, 500=19.47%, 750=10.60%, 1000=7.01%
  lat (msec)   : 2=14.85%, 4=6.20%, 10=2.10%, 20=0.54%, 50=0.34%
  lat (msec)   : 100=0.02%, 250=0.02%, 500=0.04%, 1000=0.12%, 2000=0.47%
  lat (msec)   : >=2000=0.41%
  cpu          : usr=0.36%, sys=5.25%, ctx=39901, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.4%, 4=51.8%, 8=43.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.5%, 8=3.5%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20154,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 17:27:42 2024
  write: IOPS=311, BW=1245KiB/s (1275kB/s)(78.8MiB/64837msec); 0 zone resets
    slat (nsec): min=581, max=39010k, avg=51676.65, stdev=474098.76
    clat (nsec): min=581, max=6369.2M, avg=24587046.13, stdev=284668379.33
     lat (usec): min=20, max=6369.3k, avg=24638.72, stdev=284667.70
    clat percentiles (nsec):
     |  1.00th=[      1528],  5.00th=[     46848], 10.00th=[     68096],
     | 20.00th=[    114176], 30.00th=[    187392], 40.00th=[    252928],
     | 50.00th=[    346112], 60.00th=[    477184], 70.00th=[    700416],
     | 80.00th=[   1089536], 90.00th=[   1957888], 95.00th=[   3260416],
     | 99.00th=[ 417333248], 99.50th=[1635778560], 99.90th=[5133828096],
     | 99.95th=[5804916736], 99.99th=[6341787648]
   bw (  KiB/s): min=  688, max=15016, per=100.00%, avg=5377.47, stdev=3693.73, samples=30
   iops        : min=  172, max= 3754, avg=1344.27, stdev=923.48, samples=30
  lat (nsec)   : 750=0.38%, 1000=0.19%
  lat (usec)   : 2=0.74%, 4=0.72%, 10=1.09%, 20=0.62%, 50=1.82%
  lat (usec)   : 100=11.54%, 250=22.59%, 500=21.68%, 750=10.19%, 1000=6.46%
  lat (msec)   : 2=12.28%, 4=5.54%, 10=2.11%, 20=0.64%, 50=0.35%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.04%, 1000=0.12%, 2000=0.47%
  lat (msec)   : >=2000=0.40%
  cpu          : usr=0.37%, sys=4.56%, ctx=38536, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.1%, 4=49.6%, 8=45.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.8%, 8=3.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20185,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=4891KiB/s (5009kB/s), 1190KiB/s-1245KiB/s (1218kB/s-1275kB/s), io=310MiB (325MB), run=64534-64837msec