results/test1/zvol/a/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 2 (f=2): [_(1),F(1),_(1),F(1)][100.0%][w=3KiB/s][w=7 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1103: Sat Mar 16 17:45:31 2024
  write: IOPS=352, BW=176KiB/s (180kB/s)(10.4MiB/60452msec); 0 zone resets
    slat (nsec): min=281, max=16436k, avg=29624.58, stdev=224231.44
    clat (nsec): min=561, max=12308M, avg=22459497.87, stdev=402499245.83
     lat (usec): min=16, max=12308k, avg=22489.12, stdev=402499.99
    clat percentiles (nsec):
     |  1.00th=[       1240],  5.00th=[      15040], 10.00th=[      59648],
     | 20.00th=[     107008], 30.00th=[     168960], 40.00th=[     222208],
     | 50.00th=[     292864], 60.00th=[     387072], 70.00th=[     528384],
     | 80.00th=[     823296], 90.00th=[    1679360], 95.00th=[    3260416],
     | 99.00th=[   15269888], 99.50th=[ 1098907648], 99.90th=[10536091648],
     | 99.95th=[11341398016], 99.99th=[12280922112]
   bw (  KiB/s): min=    1, max= 1701, per=100.00%, avg=910.96, stdev=563.92, samples=23
   iops        : min=    2, max= 3402, avg=1821.96, stdev=1127.88, samples=23
  lat (nsec)   : 750=0.31%, 1000=0.28%
  lat (usec)   : 2=1.53%, 4=1.33%, 10=1.11%, 20=0.98%, 50=2.02%
  lat (usec)   : 100=11.13%, 250=25.89%, 500=23.99%, 750=9.80%, 1000=5.11%
  lat (msec)   : 2=8.24%, 4=4.40%, 10=2.72%, 20=0.36%, 50=0.07%
  lat (msec)   : 500=0.03%, 750=0.07%, 1000=0.11%, 2000=0.31%, >=2000=0.23%
  cpu          : usr=0.41%, sys=3.65%, ctx=42776, majf=0, minf=0
  IO depths    : 1=0.5%, 2=3.9%, 4=47.6%, 8=48.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.8%, 8=3.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,21301,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1104: Sat Mar 16 17:45:31 2024
  write: IOPS=322, BW=161KiB/s (165kB/s)(9852KiB/61081msec); 0 zone resets
    slat (nsec): min=431, max=21439k, avg=38406.88, stdev=340081.09
    clat (nsec): min=631, max=12308M, avg=24251016.96, stdev=418411672.36
     lat (usec): min=22, max=12308k, avg=24289.42, stdev=418410.84
    clat percentiles (nsec):
     |  1.00th=[       1400],  5.00th=[      20352], 10.00th=[      66048],
     | 20.00th=[     107008], 30.00th=[     168960], 40.00th=[     224256],
     | 50.00th=[     296960], 60.00th=[     395264], 70.00th=[     544768],
     | 80.00th=[     839680], 90.00th=[    1679360], 95.00th=[    3391488],
     | 99.00th=[   18219008], 99.50th=[ 1149239296], 99.90th=[10536091648],
     | 99.95th=[11341398016], 99.99th=[12280922112]
   bw (  KiB/s): min=    1, max= 1937, per=100.00%, avg=821.08, stdev=594.09, samples=24
   iops        : min=    2, max= 3874, avg=1642.29, stdev=1188.22, samples=24
  lat (nsec)   : 750=0.21%, 1000=0.27%
  lat (usec)   : 2=1.09%, 4=1.41%, 10=1.09%, 20=0.91%, 50=1.79%
  lat (usec)   : 100=11.76%, 250=25.39%, 500=23.73%, 750=10.19%, 1000=5.48%
  lat (msec)   : 2=8.28%, 4=4.33%, 10=2.83%, 20=0.27%, 50=0.16%
  lat (msec)   : 500=0.05%, 750=0.08%, 1000=0.12%, 2000=0.32%, >=2000=0.24%
  cpu          : usr=0.37%, sys=3.34%, ctx=39130, majf=0, minf=0
  IO depths    : 1=0.7%, 2=4.6%, 4=48.0%, 8=46.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.6%, 8=3.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19704,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1105: Sat Mar 16 17:45:31 2024
  write: IOPS=323, BW=162KiB/s (165kB/s)(9828KiB/60825msec); 0 zone resets
    slat (nsec): min=521, max=16010k, avg=38450.96, stdev=198891.96
    clat (nsec): min=601, max=12308M, avg=24318783.01, stdev=418504402.61
     lat (usec): min=21, max=12308k, avg=24357.23, stdev=418504.29
    clat percentiles (nsec):
     |  1.00th=[       1144],  5.00th=[       6560], 10.00th=[      51456],
     | 20.00th=[      95744], 30.00th=[     160768], 40.00th=[     218112],
     | 50.00th=[     296960], 60.00th=[     395264], 70.00th=[     552960],
     | 80.00th=[     864256], 90.00th=[    1810432], 95.00th=[    3588096],
     | 99.00th=[   16580608], 99.50th=[ 1166016512], 99.90th=[10536091648],
     | 99.95th=[11341398016], 99.99th=[12280922112]
   bw (  KiB/s): min=    2, max= 1546, per=100.00%, avg=840.04, stdev=522.94, samples=23
   iops        : min=    4, max= 3092, avg=1680.22, stdev=1046.01, samples=23
  lat (nsec)   : 750=0.32%, 1000=0.36%
  lat (usec)   : 2=1.75%, 4=1.66%, 10=1.82%, 20=1.38%, 50=2.41%
  lat (usec)   : 100=11.10%, 250=23.68%, 500=22.67%, 750=10.13%, 1000=5.36%
  lat (msec)   : 2=8.30%, 4=4.65%, 10=3.16%, 20=0.32%, 50=0.10%
  lat (msec)   : 100=0.01%, 500=0.05%, 750=0.08%, 1000=0.12%, 2000=0.33%
  lat (msec)   : >=2000=0.24%
  cpu          : usr=0.36%, sys=3.28%, ctx=40042, majf=0, minf=0
  IO depths    : 1=0.4%, 2=3.7%, 4=49.2%, 8=46.6%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.7%, 8=3.3%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19655,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1106: Sat Mar 16 17:45:31 2024
  write: IOPS=317, BW=159KiB/s (163kB/s)(9709KiB/61081msec); 0 zone resets
    slat (nsec): min=451, max=23630k, avg=38190.13, stdev=284147.81
    clat (nsec): min=521, max=12312M, avg=24613223.51, stdev=420660040.32
     lat (usec): min=19, max=12312k, avg=24651.41, stdev=420659.68
    clat percentiles (nsec):
     |  1.00th=[       1400],  5.00th=[       9408], 10.00th=[      54528],
     | 20.00th=[      95744], 30.00th=[     154624], 40.00th=[     220160],
     | 50.00th=[     296960], 60.00th=[     407552], 70.00th=[     577536],
     | 80.00th=[     897024], 90.00th=[    1810432], 95.00th=[    3489792],
     | 99.00th=[   17956864], 99.50th=[ 1149239296], 99.90th=[10536091648],
     | 99.95th=[11341398016], 99.99th=[12280922112]
   bw (  KiB/s): min=    3, max= 1592, per=100.00%, avg=830.22, stdev=540.49, samples=23
   iops        : min=    6, max= 3184, avg=1660.57, stdev=1081.02, samples=23
  lat (nsec)   : 750=0.25%, 1000=0.34%
  lat (usec)   : 2=1.35%, 4=1.55%, 10=1.61%, 20=1.10%, 50=2.50%
  lat (usec)   : 100=12.17%, 250=23.40%, 500=22.11%, 750=9.87%, 1000=5.81%
  lat (msec)   : 2=8.88%, 4=4.78%, 10=2.99%, 20=0.33%, 50=0.10%
  lat (msec)   : 500=0.04%, 750=0.07%, 1000=0.12%, 2000=0.35%, >=2000=0.25%
  cpu          : usr=0.35%, sys=3.15%, ctx=38021, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.6%, 4=50.0%, 8=44.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.2%, 8=3.8%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19417,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=655KiB/s (671kB/s), 159KiB/s-176KiB/s (163kB/s-180kB/s), io=39.1MiB (41.0MB), run=60452-61081msec